spec/dummy/app/controllers/todos_controller.rb

INSERT INTO "todos" ("title", "description", "status", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?, ?)  [["title", "asdasd"], ["description", "asdsad"], ["status", 1], ["created_at", "2026-03-24 01:56:08.217228"], ["updated_at", "2026-03-24 01:56:08.217228"], ["user_id", 1]]
---
  def create
    @todo.save

SELECT "todos".* FROM "todos" WHERE "todos"."user_id" = ? AND "todos"."id" = ? LIMIT ?  [["user_id", 1], ["id", 2], ["LIMIT", 1]]
---
  def set_todo
    @todo = current_user.todos.find(params[:id])